---
kind: enumMember
id: F:Autodesk.Revit.DB.MarginType.UserDefined
enum: Autodesk.Revit.DB.MarginType
source: html/4a29699a-d8b0-c54b-6fb6-c831d3569435.htm
---
# Autodesk.Revit.DB.MarginType.UserDefined

The type of Margin is User Defined.